import {RefreshControl, ScrollView, StyleSheet, Text, View} from 'react-native';
import React, {useState} from 'react';
import ListNews from '../../screens/homes/ListNews';
import {useStatusBar} from '../../utils';
import colors from '../../themes/colors';
import style from '../../styles';
import HomeHeader from '../../components/header/HomeHeader';
import Slide from '../../screens/homes/Slide';
import {
  TextTranslate,
  TextTranslateBold,
} from '../../components/customs/TextTranslate';
import {size} from '../../themes/fonts';
import {paddingHorizontal} from '../../themes/layout';
import {navigate} from '../../services/navigate';

const SlideData = [
  {
    id: 1,
    title: 'វេជ្ជបណ្ឌិត ផូ សោភ័ណ្ឌ',
    image: '/Slider1.png',
    ordering: 1,
    status: 1,
    navigation_type: 'appointment',
    navigation_url: 'appointment',
    deleted_at: null,
    image_url: 'https://appadm.preahangduong.org/file_manager/Slider1.png',
  },
  {
    id: 2,
    title: 'វេជ្ជបណ្ឌិត ហេល ស្រីអិត',
    image: '/Slider2.png',
    ordering: 2,
    status: 1,
    navigation_type: 'appointment',
    navigation_url: 'appointment',
    deleted_at: null,
    image_url: 'https://appadm.preahangduong.org/file_manager/Slider2.png',
  },
  {
    id: 3,
    title: 'Facebook Cover',
    image: '/Slider3.jpg',
    ordering: 3,
    status: 1,
    navigation_type: 'link',
    navigation_url: 'https://phsartech.com/',
    deleted_at: null,
    image_url: 'https://appadm.preahangduong.org/file_manager/Slider3.jpg',
  },
];
const NewsData = [
  {
    id: 23,
    category_ids: '[3,4]',
    title: 'ជំងឺ​ឬ​ស​ដូង​បាត​ខាងក្នុង និង​ឬ​ស​ដូង​បាត​ខាងក្រៅ',
    description:
      '<p>សុខភាព៖ ជំងឺឬសដដូងបាត គឺជាបណ្ដុំសរសៃឈាមធម្មតានៅរន្ធបាតរបស់មនុស្ស ដែលជាធម្មតាវាមានបីដុំ គឺ ផ្នែកខាងស្តាំខាងមុខ ផ្នែកកខាងស្តាំខាងក្រោយ និងផ្នែកខាងឆ្វេងនៃរង្វង់រន្ធគូទ។ ទោះបីជាជំងឺនេះ មិនបានប៉ះពាល់អាយុជីវិតក៏ពិតមែន ប៉ុន្តែវាបានរំខានដល់ជីវិតប្រចាំថ្ងៃរបស់អ្នកយ៉ាងខ្លាំង ​ដូចជា មាន​​រមាស់ក្រហាយ​ ​ការរីកលៀនសរសៃឈា​ម ការបត់ជើងធំមានឈាម ជួនកាលឈឺចាប់នៅរន្ធបាត ។</p>\n<p>នៅក្នុងវិស័យវេជ្ជសាស្រ្ត ជំងឺឬសដូងបាត ត្រូវបានបែងចែកជាពីរប្រភេទ​គឺ ជំងឺឬសដូងបាតក្នុង និងជំងឺឬសដូងបាតខាងក្រៅ។</p>\n<p>ជំងឺ​ឬ​ស​ដូង​បាត​ខាងក្នុង គឺមាន​ទីតាំង​នៅក្នុង​រន្ធ​គូថ ជាទូទៅ​យើង​មិនអាច​មើលឃើញ​វានោះទេ ហើយជា​ធម្មតា​ វាមិនមាន​ការឈឺ និង​បង្ក​ជាការ​ហូរឈាម ក្នុងពេល​បត់ជើងធំឡើយ។ ជំងឺឬ​ស​ដូងបាត​ខាងក្នុង​បែបនេះ អាច​លៀន ឬ​ព្រ​លាត់ចេញទៅ​ក្រៅ​រន្ធ​គូថ​បាន។</p>\n<p>វាមានអាការៈមួយចំនួនដូចជា៖</p>\n<p>ការហូរឈាមនៅពេលកំពុងបន្ទោបង់ និងក្រោយពេលបន្ទោបង់ភ្លាមៗ<br>មានសាច់លៀនចេញមកនៅពេលប្រឹងបន្ទោបង់<br>មានកំណកឈាមកកនៅឫសដូងខាងក្នុង ដែលធ្វើឱ្យអ្នកជំងឺមានការឈឺចាប់ខ្លាំង។<br>ចំណែកជំងឺ​ឬ​ស​ដូង​បាត​ខាងក្រៅ មាន​ទីតាំងនៅ​ខាងក្រោម​ស្បែក​ជុំវិញ​រន្ធ​គូថ ដែល​យើង​អាច​ប៉ះ​វា​បាននៅពេល​វា​រីក​ធំ ព្រមទាំង​អាច​បណ្តាលឱ្យ​រមាស់ ឈឺ​នៅពេល​បត់ជើង ព្រមទាំង​ហូរឈាមផងដែរ។ វាកើតឡើង​បាន នៅពេលដែល​កំណក​ឈាម​ក្នុង​សរសៃ​ឈាមវ៉ែន​នោះ​ទៅជា​កក និង​បណ្តាលឱ្យ​ឈឺចាប់​ខ្លាំង។</p>\n<p>ភាគច្រើន វាកើតមានភ្លាមៗ ដោយការឈឺគូទភ្លាមៗ និងមានដុំប៉ោងនៅរន្ធគូទរយៈពេលពី ៣ថ្ងៃ រឺពីរបីសប្តាហ៍ ដោយសារមានដុំកំណកឈាម នៅក្នុងឫសដូងខាងក្រៅ។ វាអាចធ្វើទុក្ខលាប់ចុះឡើងច្រើនលើកច្រើនសារក៏មាន។</p>\n<p>បញ្ហានេះជាទូទៅ វាធូរស្រាលទៅវិញដោយឯកឯង ដោយមិនចាំបាច់ធ្វើការព្យាបាលនោះទេ។ ការព្យាបាលដោយថ្នាំ និងការព្យាបាលដោយចោះយកឈាមកកចេញ គឺធ្វើក្នុងគោលបំណងកាត់បន្ថយរយៈពេលវិវត្តរបស់វា។ ចំណែកឯការព្យាបាលដោយការវះកាត់ គឺធ្វើឡើងក្នុងគោលបំណងយកឫសដូងបាតចេញឱ្យអស់ និងលែងឱ្យមានការធ្វើទុក្ខបែបនេះទៀត៕</p>',
    image:
      '/0da080944dbc7fa65076fb1a501cab18-a6f4e691-ff71-4c74-913b-fc1b56d5756f.png',
    status: 1,
    type: 'symptom',
    deleted_at: null,
    image_url:
      'https://appadm.preahangduong.org/file_manager/0da080944dbc7fa65076fb1a501cab18-a6f4e691-ff71-4c74-913b-fc1b56d5756f.png',
  },
  {
    id: 2,
    category_ids: '[1]',
    title: 'យល់ដឹងខ្លីៗអំពី៖ ដុំគីសទឹកនៅលើសន្លាក់ឬសរសៃពួរ',
    description:
      '<body>\n                    <p>សុខភាព៖ ដុំគីសទឹកដែលមានឈ្មោះថា Ganglion Cyst  គឺជាថង់ថ្នក់ទឹកមួយដែលកើតនៅលើសន្លាក់ឬសរសៃពួរ ហើយភាគច្រើនគឺច្រើនកើតនៅលើ កដៃ សន្លាក់ម្រាមដៃ និងនៅលើម្រាមជើង។ ប៉ុន្តែវាក៏អាចកើតមាននៅច្រើនកន្លែងផ្សេងទៀតផងដែរ ដូចជា នៅជង្គង់ ស្មា និងឆ្អឹងកជាដើម។\n                    </br>\n                    </br>\n                    រោគសញ្ញានៃគីស Ganglion Cyst\n                    </br>\n                    ✓ អាចឡើងប៉ោងហើម\n                    </br>\n                    ✓ អាចឈឺនៅកន្លែងដែលមានគីសនេះ ឬករណីខ្លះ គឺមិនមានការឈឺចាប់ទេ\n                    </br>\n                    ✓ ករណីខ្លះ អាចពិបាកក្នុងការធ្វើចលនាសន្លាក់\n                    </br>\n                    </br>\n                    ការកំណត់រោគវិនិច្ឆ័យ\n                    </br>\n                    ✓ ក្រុមគ្រូវពេទ្យនឹងធ្វើការពិនិត្យផ្ទាល់ទៅលើដុំគីស\n                    </br>\n                    ✓ ពិនិត្យថតឆ្លុះអេកូឬ MRI\n                    </br>\n                    </br>\n                    ការព្យាបាល\n                    </br>\n                    ✓ ដុំគីសនេះមួយចំនួនអាចបាត់ទៅវិញដោយមិនចាំបាច់ព្យាបាលទេ។\n                    </br>\n                    ✓ បើសិនមានរោគសញ្ញាឬមិនបាត់ទៅវិញហើយធ្វើឲ្យមានការប៉ះពាល់ដល់បែបបទនៃការរស់នៅប្រចាំថ្ងៃ ក្រុមគ្រូពេទ្យនឹងធ្វើការព្យាបាលដោយ ធ្វើការចុះបូមទឹកគីសឬត្រូវវះកាត់យកដុំគីសចេញ។\n                    </br>\n                    </br>\n                    ដូច្នេះ គួរតែពិនិត្យនឹងតាមដានឲ្យបានត្រឹមត្រូវជាមួយក្រុមគ្រូពេទ្យជាមុនសិន៕\n                    </br>\n                    </br>\n                    -បកស្រាយដោយ៖ វេជ្ជបណ្ឌិត សុខ ពុទ្ធី (Health Education Series)\n                    </br>\n                    -កែសម្រួលដោយ៖ ក្រុមការងារ សុខក្រម (Sokhakrom)\n                    </br>\n                    -Vandhanak Vichea Clinic-មន្ទីសម្រាកព្យាបាលវឌ្ឍនៈវិជ្ជា)</p> \n                </body>',
    image: '/News2.png',
    status: 1,
    type: 'symptom',
    deleted_at: null,
    image_url: 'https://appadm.preahangduong.org/file_manager/News2.png',
  },
  {
    id: 1,
    category_ids: '[1,2,3]',
    title: 'ជំងឺរលាកសន្លាក់ឆ្អឹងខ្នងប្រភេទ Ankylosing spondylitis (AS)',
    description:
      '<p>I. សេចក្តីផ្តើម <br>១. ជំងឺរលាកសន្លាក់ឆ្អឹងខ្នងប្រភេទ Ankylosing spondylitis ( AS) គឺជាប្រភេទជំងឺរលាកសន្លាក់មួយប្រភេទទៀតដែលមានការប៉ះពាល់ដល់ឆ្អឹងកងខ្នង ជាពិសេសនៅក្នុងតំបន់សន្លាក់ឆ្អឹងត្រគៀកនិងកញ្ជូញគូទ( Sacroiliac joints ) ដែលញឹកញាប់ប៉ះពាល់ជាងគេ។ ក្រៅពីនេះក៏មានសន្លាក់ស្មារ,សន្លាក់ឆ្អឹងត្រគៀកឬសរីរាង្គផ្សេងៗទៀតដូចជា ភ្នែក,ស្បែក,ពោះវៀន,និងសួតក៏មានការប៉ះពាល់ដែរ។ <br>២. ជំងឺនេះគឺជាប្រភេទជំងឺ autoimmune disease មានន័យថាប្រព័ន្ធការពាររាងកាយយើងធ្វើការមិនប្រក្រតីដោយបានធ្វើការប្រឆាំងនឹងប្រព័ន្ធការពារខ្លួនឯងនៅលើសន្លាក់ក៏បណ្តាលឲ្យមានការរលាកនិងឈឺចាប់ផ្តើមមានឡើង <br>៣. ជំងឺនេះភាគច្រើនគឺកើតចំពោះមនុស្សប្រុសច្រើនជាងមនុស្សស្រី។ <br><br>II. រោគសញ្ញា រោគសញ្ញានៃជំងឺនេះគឺមានការប្រែប្រួលទៅតាមមនុស្សម្នាក់ៗ។ រោគសញ្ញានោះមានដូចជា៖ <br>១. ឈឺនិងតឹងណែននៅណឹងឆ្អឹងខ្នង,គូទឬក។ ការឈឺនេះគឺកាន់តែខ្លាំងពេលក្រោកពីគេងតែធូរស្រាលមកវិញពេលបានធ្វើការហាត់ប្រាណ <br>២. ឈឺចាក់នៅទ្រូងនៅផ្នែកខាងមុខឬឈឺមកដល់កែងជើងឬម្រាមជើង <br>៣. អស់កំលាំងឬមានអារម្មណ៍ថារវើយ <br>៤. យូរទៅៗអាចឲ្យមានការកោងខ្នងដែលជួនកាលមានការប៉ះដល់សួតធ្វើឲ្យហត់ <br>៥. មានការប៉ះពាល់ដល់ភ្នែក,ភ្នែកឡើងក្រហម,ឈឺ, ឬស្បែកឡើងកណ្តួលក្រហម <br><br>III. មូលហេតុ <br>ជាទូរទៅជំងឺនេះគឺមិនទាន់រកឃើញមូលហេតុពិតប្រាដកនៅឡើយទេ តែជំងឺនេះកើតឡើងដោយសារសែនម្យ៉ាងគឺ HLA-B27 ដែលភាគច្រើនអ្នកជំងឺដែលមានសែន HLA-B27 គឺងាយមាន AS ប៉ុន្តែអ្នកខ្លះមាន AS គឺមិនទាក់ទងនឹងសែន HLA-B27 ទេ។ <br><br>IV. ការកំណត់រោគវិនិច្ឆ័យ <br>១. ការសាកសួរប្រវិត្តអ្នកជំងឺនិងការពិនិត្យមើលពីរោគសញ្ញា <br>២. ការពិនិត្យឈាមមើលពីកំរិតរលាកឬ HLA-B27 និងតេស្តផ្សេងៗ ៣. ការថតឆ្អឹងខ្នង ( X ray, CT scan or MRI) <br><br>V. ការព្យាបាល ជំងឺ Ankylosing spondylitis ( AS) គឺការព្យាបាលមិនទាន់មានការព្យាបាលឲ្យជាសះស្បើយទាំងស្រុងនោះទេ។ គោលបំណងនៃការព្យាបាល គឺដើម្បី៖ <br>១. កាត់បន្ថយការឈឺ និងរោគសញ្ញាផ្សេងៗ <br>២. បង្កើននូវចលនាឲ្យប្រសើរជាងមុន <br>៣. កាត់បន្ថយការវិវត្តន៍ទៅជាមានផលវិបាកបញ្ហាធ្ងន់ធ្ងរ <br>៤. ការព្យាបាលដោយប្រើថ្នាំបំបាត់រលាក <br>៥. ការប្រើថ្នាំទប់នៃប្រព័ន្ធការពារកុំឲ្យមានការប្រឆាំងនឹងខ្លួនឯងខ្លាំង <br>៦. លើសពីព្យាបាលដោយប្រើថ្នាំទាំងនេះហើយអ្នកជំងឺគប្បីត្រូវធ្វើការហាត់ប្រាណ, បរិភោគអាហារឲ្យបានគ្រប់គ្រាន់និងត្រូវតាមដានសុខភាពជាប្រចាំជាមួយវេជ្ជបណ្ឌិត ។ <br><br>- បកស្រាយដោយ៖ វេជ្ជបណ្ឌិត សុខ ពុទ្ធី (Health Education Series) <br>- កែសម្រួលអត្ថបទដោយ៖ ក្រុមការងារ សុខក្រម (Sokhakrom) <br>- Vandhanak Vichea Clinic-មន្ទីសម្រាកព្យាបាលវឌ្ឍនៈវិជ្ជា</p>',
    image: '/News1.png',
    status: 1,
    type: 'symptom',
    deleted_at: null,
    image_url: 'https://appadm.preahangduong.org/file_manager/News1.png',
  },
  {
    id: 23,
    category_ids: '[3,4]',
    title: 'ជំងឺ​ឬ​ស​ដូង​បាត​ខាងក្នុង និង​ឬ​ស​ដូង​បាត​ខាងក្រៅ',
    description:
      '<p>សុខភាព៖ ជំងឺឬសដដូងបាត គឺជាបណ្ដុំសរសៃឈាមធម្មតានៅរន្ធបាតរបស់មនុស្ស ដែលជាធម្មតាវាមានបីដុំ គឺ ផ្នែកខាងស្តាំខាងមុខ ផ្នែកកខាងស្តាំខាងក្រោយ និងផ្នែកខាងឆ្វេងនៃរង្វង់រន្ធគូទ។ ទោះបីជាជំងឺនេះ មិនបានប៉ះពាល់អាយុជីវិតក៏ពិតមែន ប៉ុន្តែវាបានរំខានដល់ជីវិតប្រចាំថ្ងៃរបស់អ្នកយ៉ាងខ្លាំង ​ដូចជា មាន​​រមាស់ក្រហាយ​ ​ការរីកលៀនសរសៃឈា​ម ការបត់ជើងធំមានឈាម ជួនកាលឈឺចាប់នៅរន្ធបាត ។</p>\n<p>នៅក្នុងវិស័យវេជ្ជសាស្រ្ត ជំងឺឬសដូងបាត ត្រូវបានបែងចែកជាពីរប្រភេទ​គឺ ជំងឺឬសដូងបាតក្នុង និងជំងឺឬសដូងបាតខាងក្រៅ។</p>\n<p>ជំងឺ​ឬ​ស​ដូង​បាត​ខាងក្នុង គឺមាន​ទីតាំង​នៅក្នុង​រន្ធ​គូថ ជាទូទៅ​យើង​មិនអាច​មើលឃើញ​វានោះទេ ហើយជា​ធម្មតា​ វាមិនមាន​ការឈឺ និង​បង្ក​ជាការ​ហូរឈាម ក្នុងពេល​បត់ជើងធំឡើយ។ ជំងឺឬ​ស​ដូងបាត​ខាងក្នុង​បែបនេះ អាច​លៀន ឬ​ព្រ​លាត់ចេញទៅ​ក្រៅ​រន្ធ​គូថ​បាន។</p>\n<p>វាមានអាការៈមួយចំនួនដូចជា៖</p>\n<p>ការហូរឈាមនៅពេលកំពុងបន្ទោបង់ និងក្រោយពេលបន្ទោបង់ភ្លាមៗ<br>មានសាច់លៀនចេញមកនៅពេលប្រឹងបន្ទោបង់<br>មានកំណកឈាមកកនៅឫសដូងខាងក្នុង ដែលធ្វើឱ្យអ្នកជំងឺមានការឈឺចាប់ខ្លាំង។<br>ចំណែកជំងឺ​ឬ​ស​ដូង​បាត​ខាងក្រៅ មាន​ទីតាំងនៅ​ខាងក្រោម​ស្បែក​ជុំវិញ​រន្ធ​គូថ ដែល​យើង​អាច​ប៉ះ​វា​បាននៅពេល​វា​រីក​ធំ ព្រមទាំង​អាច​បណ្តាលឱ្យ​រមាស់ ឈឺ​នៅពេល​បត់ជើង ព្រមទាំង​ហូរឈាមផងដែរ។ វាកើតឡើង​បាន នៅពេលដែល​កំណក​ឈាម​ក្នុង​សរសៃ​ឈាមវ៉ែន​នោះ​ទៅជា​កក និង​បណ្តាលឱ្យ​ឈឺចាប់​ខ្លាំង។</p>\n<p>ភាគច្រើន វាកើតមានភ្លាមៗ ដោយការឈឺគូទភ្លាមៗ និងមានដុំប៉ោងនៅរន្ធគូទរយៈពេលពី ៣ថ្ងៃ រឺពីរបីសប្តាហ៍ ដោយសារមានដុំកំណកឈាម នៅក្នុងឫសដូងខាងក្រៅ។ វាអាចធ្វើទុក្ខលាប់ចុះឡើងច្រើនលើកច្រើនសារក៏មាន។</p>\n<p>បញ្ហានេះជាទូទៅ វាធូរស្រាលទៅវិញដោយឯកឯង ដោយមិនចាំបាច់ធ្វើការព្យាបាលនោះទេ។ ការព្យាបាលដោយថ្នាំ និងការព្យាបាលដោយចោះយកឈាមកកចេញ គឺធ្វើក្នុងគោលបំណងកាត់បន្ថយរយៈពេលវិវត្តរបស់វា។ ចំណែកឯការព្យាបាលដោយការវះកាត់ គឺធ្វើឡើងក្នុងគោលបំណងយកឫសដូងបាតចេញឱ្យអស់ និងលែងឱ្យមានការធ្វើទុក្ខបែបនេះទៀត៕</p>',
    image:
      '/0da080944dbc7fa65076fb1a501cab18-a6f4e691-ff71-4c74-913b-fc1b56d5756f.png',
    status: 1,
    type: 'symptom',
    deleted_at: null,
    image_url:
      'https://appadm.preahangduong.org/file_manager/0da080944dbc7fa65076fb1a501cab18-a6f4e691-ff71-4c74-913b-fc1b56d5756f.png',
  },
  {
    id: 2,
    category_ids: '[1]',
    title: 'យល់ដឹងខ្លីៗអំពី៖ ដុំគីសទឹកនៅលើសន្លាក់ឬសរសៃពួរ',
    description:
      '<body>\n                    <p>សុខភាព៖ ដុំគីសទឹកដែលមានឈ្មោះថា Ganglion Cyst  គឺជាថង់ថ្នក់ទឹកមួយដែលកើតនៅលើសន្លាក់ឬសរសៃពួរ ហើយភាគច្រើនគឺច្រើនកើតនៅលើ កដៃ សន្លាក់ម្រាមដៃ និងនៅលើម្រាមជើង។ ប៉ុន្តែវាក៏អាចកើតមាននៅច្រើនកន្លែងផ្សេងទៀតផងដែរ ដូចជា នៅជង្គង់ ស្មា និងឆ្អឹងកជាដើម។\n                    </br>\n                    </br>\n                    រោគសញ្ញានៃគីស Ganglion Cyst\n                    </br>\n                    ✓ អាចឡើងប៉ោងហើម\n                    </br>\n                    ✓ អាចឈឺនៅកន្លែងដែលមានគីសនេះ ឬករណីខ្លះ គឺមិនមានការឈឺចាប់ទេ\n                    </br>\n                    ✓ ករណីខ្លះ អាចពិបាកក្នុងការធ្វើចលនាសន្លាក់\n                    </br>\n                    </br>\n                    ការកំណត់រោគវិនិច្ឆ័យ\n                    </br>\n                    ✓ ក្រុមគ្រូវពេទ្យនឹងធ្វើការពិនិត្យផ្ទាល់ទៅលើដុំគីស\n                    </br>\n                    ✓ ពិនិត្យថតឆ្លុះអេកូឬ MRI\n                    </br>\n                    </br>\n                    ការព្យាបាល\n                    </br>\n                    ✓ ដុំគីសនេះមួយចំនួនអាចបាត់ទៅវិញដោយមិនចាំបាច់ព្យាបាលទេ។\n                    </br>\n                    ✓ បើសិនមានរោគសញ្ញាឬមិនបាត់ទៅវិញហើយធ្វើឲ្យមានការប៉ះពាល់ដល់បែបបទនៃការរស់នៅប្រចាំថ្ងៃ ក្រុមគ្រូពេទ្យនឹងធ្វើការព្យាបាលដោយ ធ្វើការចុះបូមទឹកគីសឬត្រូវវះកាត់យកដុំគីសចេញ។\n                    </br>\n                    </br>\n                    ដូច្នេះ គួរតែពិនិត្យនឹងតាមដានឲ្យបានត្រឹមត្រូវជាមួយក្រុមគ្រូពេទ្យជាមុនសិន៕\n                    </br>\n                    </br>\n                    -បកស្រាយដោយ៖ វេជ្ជបណ្ឌិត សុខ ពុទ្ធី (Health Education Series)\n                    </br>\n                    -កែសម្រួលដោយ៖ ក្រុមការងារ សុខក្រម (Sokhakrom)\n                    </br>\n                    -Vandhanak Vichea Clinic-មន្ទីសម្រាកព្យាបាលវឌ្ឍនៈវិជ្ជា)</p> \n                </body>',
    image: '/News2.png',
    status: 1,
    type: 'symptom',
    deleted_at: null,
    image_url: 'https://appadm.preahangduong.org/file_manager/News2.png',
  },
  {
    id: 1,
    category_ids: '[1,2,3]',
    title: 'ជំងឺរលាកសន្លាក់ឆ្អឹងខ្នងប្រភេទ Ankylosing spondylitis (AS)',
    description:
      '<p>I. សេចក្តីផ្តើម <br>១. ជំងឺរលាកសន្លាក់ឆ្អឹងខ្នងប្រភេទ Ankylosing spondylitis ( AS) គឺជាប្រភេទជំងឺរលាកសន្លាក់មួយប្រភេទទៀតដែលមានការប៉ះពាល់ដល់ឆ្អឹងកងខ្នង ជាពិសេសនៅក្នុងតំបន់សន្លាក់ឆ្អឹងត្រគៀកនិងកញ្ជូញគូទ( Sacroiliac joints ) ដែលញឹកញាប់ប៉ះពាល់ជាងគេ។ ក្រៅពីនេះក៏មានសន្លាក់ស្មារ,សន្លាក់ឆ្អឹងត្រគៀកឬសរីរាង្គផ្សេងៗទៀតដូចជា ភ្នែក,ស្បែក,ពោះវៀន,និងសួតក៏មានការប៉ះពាល់ដែរ។ <br>២. ជំងឺនេះគឺជាប្រភេទជំងឺ autoimmune disease មានន័យថាប្រព័ន្ធការពាររាងកាយយើងធ្វើការមិនប្រក្រតីដោយបានធ្វើការប្រឆាំងនឹងប្រព័ន្ធការពារខ្លួនឯងនៅលើសន្លាក់ក៏បណ្តាលឲ្យមានការរលាកនិងឈឺចាប់ផ្តើមមានឡើង <br>៣. ជំងឺនេះភាគច្រើនគឺកើតចំពោះមនុស្សប្រុសច្រើនជាងមនុស្សស្រី។ <br><br>II. រោគសញ្ញា រោគសញ្ញានៃជំងឺនេះគឺមានការប្រែប្រួលទៅតាមមនុស្សម្នាក់ៗ។ រោគសញ្ញានោះមានដូចជា៖ <br>១. ឈឺនិងតឹងណែននៅណឹងឆ្អឹងខ្នង,គូទឬក។ ការឈឺនេះគឺកាន់តែខ្លាំងពេលក្រោកពីគេងតែធូរស្រាលមកវិញពេលបានធ្វើការហាត់ប្រាណ <br>២. ឈឺចាក់នៅទ្រូងនៅផ្នែកខាងមុខឬឈឺមកដល់កែងជើងឬម្រាមជើង <br>៣. អស់កំលាំងឬមានអារម្មណ៍ថារវើយ <br>៤. យូរទៅៗអាចឲ្យមានការកោងខ្នងដែលជួនកាលមានការប៉ះដល់សួតធ្វើឲ្យហត់ <br>៥. មានការប៉ះពាល់ដល់ភ្នែក,ភ្នែកឡើងក្រហម,ឈឺ, ឬស្បែកឡើងកណ្តួលក្រហម <br><br>III. មូលហេតុ <br>ជាទូរទៅជំងឺនេះគឺមិនទាន់រកឃើញមូលហេតុពិតប្រាដកនៅឡើយទេ តែជំងឺនេះកើតឡើងដោយសារសែនម្យ៉ាងគឺ HLA-B27 ដែលភាគច្រើនអ្នកជំងឺដែលមានសែន HLA-B27 គឺងាយមាន AS ប៉ុន្តែអ្នកខ្លះមាន AS គឺមិនទាក់ទងនឹងសែន HLA-B27 ទេ។ <br><br>IV. ការកំណត់រោគវិនិច្ឆ័យ <br>១. ការសាកសួរប្រវិត្តអ្នកជំងឺនិងការពិនិត្យមើលពីរោគសញ្ញា <br>២. ការពិនិត្យឈាមមើលពីកំរិតរលាកឬ HLA-B27 និងតេស្តផ្សេងៗ ៣. ការថតឆ្អឹងខ្នង ( X ray, CT scan or MRI) <br><br>V. ការព្យាបាល ជំងឺ Ankylosing spondylitis ( AS) គឺការព្យាបាលមិនទាន់មានការព្យាបាលឲ្យជាសះស្បើយទាំងស្រុងនោះទេ។ គោលបំណងនៃការព្យាបាល គឺដើម្បី៖ <br>១. កាត់បន្ថយការឈឺ និងរោគសញ្ញាផ្សេងៗ <br>២. បង្កើននូវចលនាឲ្យប្រសើរជាងមុន <br>៣. កាត់បន្ថយការវិវត្តន៍ទៅជាមានផលវិបាកបញ្ហាធ្ងន់ធ្ងរ <br>៤. ការព្យាបាលដោយប្រើថ្នាំបំបាត់រលាក <br>៥. ការប្រើថ្នាំទប់នៃប្រព័ន្ធការពារកុំឲ្យមានការប្រឆាំងនឹងខ្លួនឯងខ្លាំង <br>៦. លើសពីព្យាបាលដោយប្រើថ្នាំទាំងនេះហើយអ្នកជំងឺគប្បីត្រូវធ្វើការហាត់ប្រាណ, បរិភោគអាហារឲ្យបានគ្រប់គ្រាន់និងត្រូវតាមដានសុខភាពជាប្រចាំជាមួយវេជ្ជបណ្ឌិត ។ <br><br>- បកស្រាយដោយ៖ វេជ្ជបណ្ឌិត សុខ ពុទ្ធី (Health Education Series) <br>- កែសម្រួលអត្ថបទដោយ៖ ក្រុមការងារ សុខក្រម (Sokhakrom) <br>- Vandhanak Vichea Clinic-មន្ទីសម្រាកព្យាបាលវឌ្ឍនៈវិជ្ជា</p>',
    image: '/News1.png',
    status: 1,
    type: 'symptom',
    deleted_at: null,
    image_url: 'https://appadm.preahangduong.org/file_manager/News1.png',
  },
  {
    id: 23,
    category_ids: '[3,4]',
    title: 'ជំងឺ​ឬ​ស​ដូង​បាត​ខាងក្នុង និង​ឬ​ស​ដូង​បាត​ខាងក្រៅ',
    description:
      '<p>សុខភាព៖ ជំងឺឬសដដូងបាត គឺជាបណ្ដុំសរសៃឈាមធម្មតានៅរន្ធបាតរបស់មនុស្ស ដែលជាធម្មតាវាមានបីដុំ គឺ ផ្នែកខាងស្តាំខាងមុខ ផ្នែកកខាងស្តាំខាងក្រោយ និងផ្នែកខាងឆ្វេងនៃរង្វង់រន្ធគូទ។ ទោះបីជាជំងឺនេះ មិនបានប៉ះពាល់អាយុជីវិតក៏ពិតមែន ប៉ុន្តែវាបានរំខានដល់ជីវិតប្រចាំថ្ងៃរបស់អ្នកយ៉ាងខ្លាំង ​ដូចជា មាន​​រមាស់ក្រហាយ​ ​ការរីកលៀនសរសៃឈា​ម ការបត់ជើងធំមានឈាម ជួនកាលឈឺចាប់នៅរន្ធបាត ។</p>\n<p>នៅក្នុងវិស័យវេជ្ជសាស្រ្ត ជំងឺឬសដូងបាត ត្រូវបានបែងចែកជាពីរប្រភេទ​គឺ ជំងឺឬសដូងបាតក្នុង និងជំងឺឬសដូងបាតខាងក្រៅ។</p>\n<p>ជំងឺ​ឬ​ស​ដូង​បាត​ខាងក្នុង គឺមាន​ទីតាំង​នៅក្នុង​រន្ធ​គូថ ជាទូទៅ​យើង​មិនអាច​មើលឃើញ​វានោះទេ ហើយជា​ធម្មតា​ វាមិនមាន​ការឈឺ និង​បង្ក​ជាការ​ហូរឈាម ក្នុងពេល​បត់ជើងធំឡើយ។ ជំងឺឬ​ស​ដូងបាត​ខាងក្នុង​បែបនេះ អាច​លៀន ឬ​ព្រ​លាត់ចេញទៅ​ក្រៅ​រន្ធ​គូថ​បាន។</p>\n<p>វាមានអាការៈមួយចំនួនដូចជា៖</p>\n<p>ការហូរឈាមនៅពេលកំពុងបន្ទោបង់ និងក្រោយពេលបន្ទោបង់ភ្លាមៗ<br>មានសាច់លៀនចេញមកនៅពេលប្រឹងបន្ទោបង់<br>មានកំណកឈាមកកនៅឫសដូងខាងក្នុង ដែលធ្វើឱ្យអ្នកជំងឺមានការឈឺចាប់ខ្លាំង។<br>ចំណែកជំងឺ​ឬ​ស​ដូង​បាត​ខាងក្រៅ មាន​ទីតាំងនៅ​ខាងក្រោម​ស្បែក​ជុំវិញ​រន្ធ​គូថ ដែល​យើង​អាច​ប៉ះ​វា​បាននៅពេល​វា​រីក​ធំ ព្រមទាំង​អាច​បណ្តាលឱ្យ​រមាស់ ឈឺ​នៅពេល​បត់ជើង ព្រមទាំង​ហូរឈាមផងដែរ។ វាកើតឡើង​បាន នៅពេលដែល​កំណក​ឈាម​ក្នុង​សរសៃ​ឈាមវ៉ែន​នោះ​ទៅជា​កក និង​បណ្តាលឱ្យ​ឈឺចាប់​ខ្លាំង។</p>\n<p>ភាគច្រើន វាកើតមានភ្លាមៗ ដោយការឈឺគូទភ្លាមៗ និងមានដុំប៉ោងនៅរន្ធគូទរយៈពេលពី ៣ថ្ងៃ រឺពីរបីសប្តាហ៍ ដោយសារមានដុំកំណកឈាម នៅក្នុងឫសដូងខាងក្រៅ។ វាអាចធ្វើទុក្ខលាប់ចុះឡើងច្រើនលើកច្រើនសារក៏មាន។</p>\n<p>បញ្ហានេះជាទូទៅ វាធូរស្រាលទៅវិញដោយឯកឯង ដោយមិនចាំបាច់ធ្វើការព្យាបាលនោះទេ។ ការព្យាបាលដោយថ្នាំ និងការព្យាបាលដោយចោះយកឈាមកកចេញ គឺធ្វើក្នុងគោលបំណងកាត់បន្ថយរយៈពេលវិវត្តរបស់វា។ ចំណែកឯការព្យាបាលដោយការវះកាត់ គឺធ្វើឡើងក្នុងគោលបំណងយកឫសដូងបាតចេញឱ្យអស់ និងលែងឱ្យមានការធ្វើទុក្ខបែបនេះទៀត៕</p>',
    image:
      '/0da080944dbc7fa65076fb1a501cab18-a6f4e691-ff71-4c74-913b-fc1b56d5756f.png',
    status: 1,
    type: 'symptom',
    deleted_at: null,
    image_url:
      'https://appadm.preahangduong.org/file_manager/0da080944dbc7fa65076fb1a501cab18-a6f4e691-ff71-4c74-913b-fc1b56d5756f.png',
  },
  {
    id: 2,
    category_ids: '[1]',
    title: 'យល់ដឹងខ្លីៗអំពី៖ ដុំគីសទឹកនៅលើសន្លាក់ឬសរសៃពួរ',
    description:
      '<body>\n                    <p>សុខភាព៖ ដុំគីសទឹកដែលមានឈ្មោះថា Ganglion Cyst  គឺជាថង់ថ្នក់ទឹកមួយដែលកើតនៅលើសន្លាក់ឬសរសៃពួរ ហើយភាគច្រើនគឺច្រើនកើតនៅលើ កដៃ សន្លាក់ម្រាមដៃ និងនៅលើម្រាមជើង។ ប៉ុន្តែវាក៏អាចកើតមាននៅច្រើនកន្លែងផ្សេងទៀតផងដែរ ដូចជា នៅជង្គង់ ស្មា និងឆ្អឹងកជាដើម។\n                    </br>\n                    </br>\n                    រោគសញ្ញានៃគីស Ganglion Cyst\n                    </br>\n                    ✓ អាចឡើងប៉ោងហើម\n                    </br>\n                    ✓ អាចឈឺនៅកន្លែងដែលមានគីសនេះ ឬករណីខ្លះ គឺមិនមានការឈឺចាប់ទេ\n                    </br>\n                    ✓ ករណីខ្លះ អាចពិបាកក្នុងការធ្វើចលនាសន្លាក់\n                    </br>\n                    </br>\n                    ការកំណត់រោគវិនិច្ឆ័យ\n                    </br>\n                    ✓ ក្រុមគ្រូវពេទ្យនឹងធ្វើការពិនិត្យផ្ទាល់ទៅលើដុំគីស\n                    </br>\n                    ✓ ពិនិត្យថតឆ្លុះអេកូឬ MRI\n                    </br>\n                    </br>\n                    ការព្យាបាល\n                    </br>\n                    ✓ ដុំគីសនេះមួយចំនួនអាចបាត់ទៅវិញដោយមិនចាំបាច់ព្យាបាលទេ។\n                    </br>\n                    ✓ បើសិនមានរោគសញ្ញាឬមិនបាត់ទៅវិញហើយធ្វើឲ្យមានការប៉ះពាល់ដល់បែបបទនៃការរស់នៅប្រចាំថ្ងៃ ក្រុមគ្រូពេទ្យនឹងធ្វើការព្យាបាលដោយ ធ្វើការចុះបូមទឹកគីសឬត្រូវវះកាត់យកដុំគីសចេញ។\n                    </br>\n                    </br>\n                    ដូច្នេះ គួរតែពិនិត្យនឹងតាមដានឲ្យបានត្រឹមត្រូវជាមួយក្រុមគ្រូពេទ្យជាមុនសិន៕\n                    </br>\n                    </br>\n                    -បកស្រាយដោយ៖ វេជ្ជបណ្ឌិត សុខ ពុទ្ធី (Health Education Series)\n                    </br>\n                    -កែសម្រួលដោយ៖ ក្រុមការងារ សុខក្រម (Sokhakrom)\n                    </br>\n                    -Vandhanak Vichea Clinic-មន្ទីសម្រាកព្យាបាលវឌ្ឍនៈវិជ្ជា)</p> \n                </body>',
    image: '/News2.png',
    status: 1,
    type: 'symptom',
    deleted_at: null,
    image_url: 'https://appadm.preahangduong.org/file_manager/News2.png',
  },
  {
    id: 1,
    category_ids: '[1,2,3]',
    title: 'ជំងឺរលាកសន្លាក់ឆ្អឹងខ្នងប្រភេទ Ankylosing spondylitis (AS)',
    description:
      '<p>I. សេចក្តីផ្តើម <br>១. ជំងឺរលាកសន្លាក់ឆ្អឹងខ្នងប្រភេទ Ankylosing spondylitis ( AS) គឺជាប្រភេទជំងឺរលាកសន្លាក់មួយប្រភេទទៀតដែលមានការប៉ះពាល់ដល់ឆ្អឹងកងខ្នង ជាពិសេសនៅក្នុងតំបន់សន្លាក់ឆ្អឹងត្រគៀកនិងកញ្ជូញគូទ( Sacroiliac joints ) ដែលញឹកញាប់ប៉ះពាល់ជាងគេ។ ក្រៅពីនេះក៏មានសន្លាក់ស្មារ,សន្លាក់ឆ្អឹងត្រគៀកឬសរីរាង្គផ្សេងៗទៀតដូចជា ភ្នែក,ស្បែក,ពោះវៀន,និងសួតក៏មានការប៉ះពាល់ដែរ។ <br>២. ជំងឺនេះគឺជាប្រភេទជំងឺ autoimmune disease មានន័យថាប្រព័ន្ធការពាររាងកាយយើងធ្វើការមិនប្រក្រតីដោយបានធ្វើការប្រឆាំងនឹងប្រព័ន្ធការពារខ្លួនឯងនៅលើសន្លាក់ក៏បណ្តាលឲ្យមានការរលាកនិងឈឺចាប់ផ្តើមមានឡើង <br>៣. ជំងឺនេះភាគច្រើនគឺកើតចំពោះមនុស្សប្រុសច្រើនជាងមនុស្សស្រី។ <br><br>II. រោគសញ្ញា រោគសញ្ញានៃជំងឺនេះគឺមានការប្រែប្រួលទៅតាមមនុស្សម្នាក់ៗ។ រោគសញ្ញានោះមានដូចជា៖ <br>១. ឈឺនិងតឹងណែននៅណឹងឆ្អឹងខ្នង,គូទឬក។ ការឈឺនេះគឺកាន់តែខ្លាំងពេលក្រោកពីគេងតែធូរស្រាលមកវិញពេលបានធ្វើការហាត់ប្រាណ <br>២. ឈឺចាក់នៅទ្រូងនៅផ្នែកខាងមុខឬឈឺមកដល់កែងជើងឬម្រាមជើង <br>៣. អស់កំលាំងឬមានអារម្មណ៍ថារវើយ <br>៤. យូរទៅៗអាចឲ្យមានការកោងខ្នងដែលជួនកាលមានការប៉ះដល់សួតធ្វើឲ្យហត់ <br>៥. មានការប៉ះពាល់ដល់ភ្នែក,ភ្នែកឡើងក្រហម,ឈឺ, ឬស្បែកឡើងកណ្តួលក្រហម <br><br>III. មូលហេតុ <br>ជាទូរទៅជំងឺនេះគឺមិនទាន់រកឃើញមូលហេតុពិតប្រាដកនៅឡើយទេ តែជំងឺនេះកើតឡើងដោយសារសែនម្យ៉ាងគឺ HLA-B27 ដែលភាគច្រើនអ្នកជំងឺដែលមានសែន HLA-B27 គឺងាយមាន AS ប៉ុន្តែអ្នកខ្លះមាន AS គឺមិនទាក់ទងនឹងសែន HLA-B27 ទេ។ <br><br>IV. ការកំណត់រោគវិនិច្ឆ័យ <br>១. ការសាកសួរប្រវិត្តអ្នកជំងឺនិងការពិនិត្យមើលពីរោគសញ្ញា <br>២. ការពិនិត្យឈាមមើលពីកំរិតរលាកឬ HLA-B27 និងតេស្តផ្សេងៗ ៣. ការថតឆ្អឹងខ្នង ( X ray, CT scan or MRI) <br><br>V. ការព្យាបាល ជំងឺ Ankylosing spondylitis ( AS) គឺការព្យាបាលមិនទាន់មានការព្យាបាលឲ្យជាសះស្បើយទាំងស្រុងនោះទេ។ គោលបំណងនៃការព្យាបាល គឺដើម្បី៖ <br>១. កាត់បន្ថយការឈឺ និងរោគសញ្ញាផ្សេងៗ <br>២. បង្កើននូវចលនាឲ្យប្រសើរជាងមុន <br>៣. កាត់បន្ថយការវិវត្តន៍ទៅជាមានផលវិបាកបញ្ហាធ្ងន់ធ្ងរ <br>៤. ការព្យាបាលដោយប្រើថ្នាំបំបាត់រលាក <br>៥. ការប្រើថ្នាំទប់នៃប្រព័ន្ធការពារកុំឲ្យមានការប្រឆាំងនឹងខ្លួនឯងខ្លាំង <br>៦. លើសពីព្យាបាលដោយប្រើថ្នាំទាំងនេះហើយអ្នកជំងឺគប្បីត្រូវធ្វើការហាត់ប្រាណ, បរិភោគអាហារឲ្យបានគ្រប់គ្រាន់និងត្រូវតាមដានសុខភាពជាប្រចាំជាមួយវេជ្ជបណ្ឌិត ។ <br><br>- បកស្រាយដោយ៖ វេជ្ជបណ្ឌិត សុខ ពុទ្ធី (Health Education Series) <br>- កែសម្រួលអត្ថបទដោយ៖ ក្រុមការងារ សុខក្រម (Sokhakrom) <br>- Vandhanak Vichea Clinic-មន្ទីសម្រាកព្យាបាលវឌ្ឍនៈវិជ្ជា</p>',
    image: '/News1.png',
    status: 1,
    type: 'symptom',
    deleted_at: null,
    image_url: 'https://appadm.preahangduong.org/file_manager/News1.png',
  },
];
const HomeScreen = () => {
  useStatusBar('dark-content', colors.whiteColor);
  const [refresh, setRefresh] = useState(false);

  const onDetail = (id: number) => {
    navigate('NewDetail', {id});
  };

  const onRefresh = () => {
    setRefresh(true);
    setTimeout(() => {
      setRefresh(false);
    }, 200);
  };

  const onSearch = () => {
    navigate('SearchScreen');
  };

  return (
    <>
      <HomeHeader onSearch={onSearch} />
      <View style={[style.flexContainer]}>
        <ScrollView
          refreshControl={
            <RefreshControl refreshing={refresh} onRefresh={onRefresh} />
          }
          showsVerticalScrollIndicator={false}>
          <Slide data={SlideData} onPress={onDetail} />
          <TextTranslateBold style={styles.title}>news</TextTranslateBold>
          <ListNews data={NewsData} onDetail={onDetail} />
        </ScrollView>
      </View>
    </>
  );
};

export default HomeScreen;

const styles = StyleSheet.create({
  title: {
    fontSize: size.font18,
    paddingHorizontal,
  },
});
